{
  "descriptors": {
    "components": [
      {
        "id": "kafka",
        "type": "org.apache.flume.sink.kafka.KafkaSink",
        "name": "Kafka Sink",
        "description": "This is a Flume Sink implementation that can publish data to a Kafka topic. One of the objective is to integrate Flume with Kafka so that pull based processing systems can process the data coming through various Flume sources. This currently supports Kafka 0.8.x series of releases.",
        "settings": {
          "brokerList": {
            "type": "",
            "name": "Broker list",
            "description": "List of brokers Kafka-Sink will connect to, to get the list of topic partitions This can be a partial list of brokers, but we recommend at least two for HA. The format is comma separated list of hostname:port",
            "default": "",
            "required": true
          },
          "topic": {
            "type": "",
            "name": "Topic",
            "description": "The topic in Kafka to which the messages will be published. If this parameter is configured, messages will be published to this topic. If the event header contains a “topic” field, the event will be published to that topic overriding the topic configured here.",
            "default": " 	default-flume-topic",
            "required": false
          },
          "batchSize": {
            "type": "integer",
            "name": "Batch size",
            "description": "How many messages to process in one batch. Larger batches improve throughput while adding latency.",
            "default": 100,
            "required": false
          },
          "requiredAcks": {
            "type": "integer",
            "name": "Required ACKs",
            "description": "How many replicas must acknowledge a message before its considered successfully written. Accepted values are 0 (Never wait for acknowledgement), 1 (wait for leader only), -1 (wait for all replicas) Set this to -1 to avoid data loss in some cases of leader failure.",
            "default": 1,
            "required": false
          },
          "Other Kafka Producer Properties": {
            "type": "",
            "name": "Other Kafka Producer Properties",
            "description": "These properties are used to configure the Kafka Producer. Any producer property supported by Kafka can be used. The only requirement is to prepend the property name with the prefix kafka.. For example: kafka.producer.type",
            "default": "",
            "required": false
          }
        },
        "ports": {
          "channels": {

          }
        },
        "ui": {
          "groups": [

          ]
        }
      }
    ]
  }
}